In [1]:
#import dependencies
import pandas as pd

In [2]:
#create path
file_to_load = "purchase_data.csv"

In [3]:
#import and read csv
purchase_data = pd.read_csv(file_to_load)

In [4]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [5]:
purchase_data.count()

Purchase ID    780
SN             780
Age            780
Gender         780
Item ID        780
Item Name      780
Price          780
dtype: int64

In [6]:
#find total number of players
len(purchase_data["SN"].unique())

576

In [7]:
total_players = [{"Total Players": 576}]

In [8]:
df_total_players = pd.DataFrame(total_players)
df_total_players

   Total Players
0            576

In [9]:
#do purchasing analysis
purchase_data.describe()

       Purchase ID         Age     Item ID       Price
count   780.000000  780.000000  780.000000  780.000000
mean    389.500000   22.714103   92.114103    3.050987
std     225.310896    6.659444   52.775943    1.169549
min       0.000000    7.000000    0.000000    1.000000
25%     194.750000   20.000000   48.000000    1.980000
50%     389.500000   22.000000   93.000000    3.150000
75%     584.250000   25.000000  139.000000    4.080000
max     779.000000   45.000000  183.000000    4.990000

In [10]:
purchase_data["Price"].mean()

3.050987179487176

In [11]:
purchase_data["Purchase ID"].count()

780

In [12]:
purchase_data["Item ID"].max()

183

In [13]:
purchase_data["Price"].sum()

2379.77

In [14]:
#build dataframe from purchasing analysis
df_purchase_data = [{"Number of Unique Items": 183, "Average Price": "$3.05", 
                    "Number of Purchase": 780, "Total Revenue": "$2379.77"}]
df_purchase_data = pd.DataFrame(df_purchase_data)
df_purchase_data

   Number of Unique Items Average Price  Number of Purchase Total Revenue
0                     183         $3.05                 780      $2379.77

In [15]:
purchase_data["Gender"].unique()

array(['Male', 'Other / Non-Disclosed', 'Female'], dtype=object)

In [16]:
#find totals of male, female, and other players
duplicate = purchase_data.drop_duplicates(subset='SN', keep="first")
total_gender = duplicate["Gender"].count()
male_total = duplicate["Gender"].value_counts()['Male']
female_total = duplicate["Gender"].value_counts()['Female']
other_total = total_gender - male_total - female_total

male_total, female_total, other_total

(484, 81, 11)

In [17]:
#find percentage of male, female, and other players
male_percent = (male_total / total_gender) * 100
female_percent = (female_total / total_gender) * 100
other_percent = (other_total / total_gender) * 100

male_percent, female_percent, other_percent

(84.02777777777779, 14.0625, 1.9097222222222223)

In [18]:
#create and format data frame
gender_demo = pd.DataFrame({"": ['Male', 'Female', 'Other/Non-Disclosed'],
                            "Total Count": [male_total, female_total, other_total],
                           "Percentage of Players": [male_percent, female_percent, other_percent]})

gender_demo["Percentage of Players"] = gender_demo["Percentage of Players"].map("{:.2f}%".format)
gender_demo = gender_demo.set_index('')
gender_demo

                     Total Count Percentage of Players

Male                         484                84.03%
Female                        81                14.06%
Other/Non-Disclosed           11                 1.91%

In [19]:
#run calculations to obtain purchasing analysis by gender
gender_group = purchase_data.groupby(["Gender"])

purchase_count = gender_group["SN"].count()
avg_purchase_price = gender_group["Price"].mean()
total_purchase_value = gender_group["Price"].sum()

purchase_count, avg_purchase_price, total_purchase_value

(Gender
 Female                   113
 Male                     652
 Other / Non-Disclosed     15
 Name: SN, dtype: int64, Gender
 Female                   3.203009
 Male                     3.017853
 Other / Non-Disclosed    3.346000
 Name: Price, dtype: float64, Gender
 Female                    361.94
 Male                     1967.64
 Other / Non-Disclosed      50.19
 Name: Price, dtype: float64)

In [20]:
duplicate = purchase_data.drop_duplicates(subset='SN', keep="first")
grouped_dup = duplicate.groupby(["Gender"])

avg_purch_per_person = (gender_group["Price"].sum() / grouped_dup["SN"].count())

avg_purch_per_person

Gender
Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [21]:
#create dataframe
gender_purchase_analysis = pd.DataFrame({"Purchase Count": purchase_count,
                              "Average Purchase Price": avg_purchase_price,
                              "Total Purchase Value": total_purchase_value,
                              "Average Total Purchases Per Person": avg_purch_per_person})

gender_purchase_analysis

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Total Purchases Per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [22]:
#format data frame 
gender_purchase_analysis["Average Purchase Price"] = gender_purchase_analysis["Average Purchase Price"].map("${:.2f}".format)
gender_purchase_analysis["Total Purchase Value"] = gender_purchase_analysis["Total Purchase Value"].map("${:.2f}".format)
gender_purchase_analysis["Average Total Purchases Per Person"] = gender_purchase_analysis["Average Total Purchases Per Person"].map("${:.2f}".format)
gender_purchases_analysis = gender_purchase_analysis[["Purchase Count", "Average Purchase Price", "Total Purchase Value", "Average Total Purchases Per Person"]]

gender_purchases_analysis

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Total Purchases Per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,$1967.64,$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

In [23]:
#create bins for age demographics
bins = [0,10,15,20,25,30,35,40,100]
ages = ['<10', '10 - 14', '15 - 19', '20 - 24', '25 - 29', '30 - 34', '35 - 39', '40+']

In [24]:
#group bins and calculate data
bin_df = purchase_data.copy()
bin_df["Age Ranges"] = pd.cut(bin_df["Age"], bins, labels=ages)
bin_group = bin_df.groupby(["Age Ranges"])

bin_count = bin_group["SN"].count()
total_count = purchase_data["SN"].count()
player_percentage = (bin_count / total_count) * 100
player_percentage

Age Ranges
<10         4.102564
10 - 14     6.923077
15 - 19    25.641026
20 - 24    41.666667
25 - 29     9.871795
30 - 34     6.666667
35 - 39     4.230769
40+         0.897436
Name: SN, dtype: float64

In [25]:
#create and format dataframe
age_demo_df = pd.DataFrame({"Total Count": bin_count,
                         "Percentage of Players": player_percentage})

age_demo_df["Percentage of Players"] = age_demo_df["Percentage of Players"].map("{:.2f}%".format)
age_demo_df

            Total Count Percentage of Players
Age Ranges
<10                  32                 4.10%
10 - 14              54                 6.92%
15 - 19             200                25.64%
20 - 24             325                41.67%
25 - 29              77                 9.87%
30 - 34              52                 6.67%
35 - 39              33                 4.23%
40+                   7                 0.90%

In [26]:
#create bins for purchasing analysis by age
bins = [0,10,15,20,25,30,35,40,100]
ages = ['<10', '10 - 14', '15 - 19', '20 - 24', '25 - 29', '30 - 34', '35 - 39', '40+']

In [27]:
#group bins
bins_df = purchase_data.copy()
bins_df["Age Ranges"] = pd.cut(bins_df["Age"], bins, labels=ages)
bin_column = pd.cut(bins_df["Age"], bins, labels=ages)
bins_group = bins_df.groupby(["Age Ranges"])

In [28]:
#calculate data
bin_purchase = bins_group["Age"].count()
bin_avg = bins_group["Price"].mean()
bin_total = bins_group["Price"].sum()

bins_duplicate = purchase_data.drop_duplicates(subset='SN', keep="first")
bins_duplicate["Age Ranges"] = pd.cut(bins_duplicate["Age"], bins, labels=ages)
bins_duplicate = bins_duplicate.groupby(["Age Ranges"])

bin_avg_total = (bins_group["Price"].sum() / bins_duplicate["SN"].count())
bin_avg_total

/Users/andrewroche/anaconda3/envs/PythonData/lib/python3.6/site-packages/ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  import sys

Age Ranges
<10        4.540000
10 - 14    3.819512
15 - 19    4.143733
20 - 24    4.231207
25 - 29    3.752881
30 - 34    4.208378
35 - 39    4.321154
40+        3.075714
dtype: float64

In [29]:
#create and format dataframe
age_analysis = pd.DataFrame({"Purchase Count": bin_purchase,
                         "Average Purchase Price": bin_avg,
                         "Total Purchase Value": bin_total,
                         "Average Total Purchases Per Person": bin_avg_total})

age_analysis["Average Purchase Price"] = age_analysis["Average Purchase Price"].map("${:.2f}".format)
age_analysis["Total Purchase Value"] = age_analysis["Total Purchase Value"].map("${:.2f}".format)
age_analysis["Average Total Purchases Per Person"] = age_analysis["Average Total Purchases Per Person"].map("${:.2f}".format)
age_analysis = age_analysis[["Purchase Count", "Average Purchase Price", "Total Purchase Value", "Average Total Purchases Per Person"]]
age_analysis

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Total Purchases Per Person
Age Ranges,,,,
<10,32,$3.40,$108.96,$4.54
10 - 14,54,$2.90,$156.60,$3.82
15 - 19,200,$3.11,$621.56,$4.14
20 - 24,325,$3.02,$981.64,$4.23
25 - 29,77,$2.88,$221.42,$3.75
30 - 34,52,$2.99,$155.71,$4.21
35 - 39,33,$3.40,$112.35,$4.32
40+,7,$3.08,$21.53,$3.08

In [30]:
#run calculations on data for top spenders
top_spender_group = purchase_data.groupby(["SN"])
purchase_count = top_spender_group["Item ID"].count()
total_value = top_spender_group["Price"].sum()
avg_value = (total_value / purchase_count)

purchase_count.head(), total_value.head(), avg_value.head()

(SN
 Adairialis76    1
 Adastirin33     1
 Aeda94          1
 Aela59          1
 Aelaria33       1
 Name: Item ID, dtype: int64, SN
 Adairialis76    2.28
 Adastirin33     4.48
 Aeda94          4.91
 Aela59          4.32
 Aelaria33       1.79
 Name: Price, dtype: float64, SN
 Adairialis76    2.28
 Adastirin33     4.48
 Aeda94          4.91
 Aela59          4.32
 Aelaria33       1.79
 dtype: float64)

In [31]:
#create and format dataframe
top_spender_df = pd.DataFrame({"Purchase Count": purchase_count,
                         "Average Purchase Price": avg_value,
                         "Total Purchase Value": total_value})

top_spender_df = top_spender_df.sort_values("Total Purchase Value", ascending=False) 
top_spender_df["Average Purchase Price"] = top_spender_df["Average Purchase Price"].map("${:.2f}".format)
top_spender_df["Total Purchase Value"] = top_spender_df["Total Purchase Value"].map("${:.2f}".format)
top_spender_df = top_spender_df[["Purchase Count", "Average Purchase Price", "Total Purchase Value"]]
top_spender_df.head()

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

In [32]:
#group and perform calculations for most popular item
item_group = purchase_data.groupby(["Item ID", "Item Name"])
item_count = item_group["SN"].count()
item_price = item_group["Price"].sum()
item_avg = (item_price / item_count)
item_total_value = (item_avg * item_count)

item_count.head(), item_price.head(), item_total_value.head()

(Item ID  Item Name
 0        Splinter              4
 1        Crucifer              3
 2        Verdict               6
 3        Phantomlight          6
 4        Bloodlord's Fetish    5
 Name: SN, dtype: int64, Item ID  Item Name
 0        Splinter               5.12
 1        Crucifer               9.78
 2        Verdict               14.88
 3        Phantomlight          14.94
 4        Bloodlord's Fetish     8.50
 Name: Price, dtype: float64, Item ID  Item Name
 0        Splinter               5.12
 1        Crucifer               9.78
 2        Verdict               14.88
 3        Phantomlight          14.94
 4        Bloodlord's Fetish     8.50
 dtype: float64)

In [33]:
#create and format dataframe
Popular_item = pd.DataFrame({"Purchase Count": item_count,
                          "Item Price": item_avg,
                          "Total Purchase Value": item_total_value})

Popular_item = Popular_item.sort_values("Purchase Count", ascending=False) 
Popular_item["Item Price"] = Popular_item["Item Price"].map("${:.2f}".format)
Popular_item["Total Purchase Value"] = Popular_item["Total Purchase Value"].map("${:.2f}".format)
Popular_item = Popular_item[["Purchase Count", "Item Price", "Total Purchase Value"]]
Popular_item.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
82,Nirvana,9,$4.90,$44.10
19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16

In [34]:
#use above table and change the descending column
Popular_item = pd.DataFrame({"Purchase Count": item_count,
                          "Item Price": item_avg,
                          "Total Purchase Value": item_total_value})

Popular_item = Popular_item.sort_values("Total Purchase Value", ascending=False) 
Popular_item["Item Price"] = Popular_item["Item Price"].map("${:.2f}".format)
Popular_item["Total Purchase Value"] = Popular_item["Total Purchase Value"].map("${:.2f}".format)
Popular_item = Popular_item[["Purchase Count", "Item Price", "Total Purchase Value"]]
Popular_item.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
92,Final Critic,8,$4.88,$39.04
103,Singed Scalpel,8,$4.35,$34.80

observation 1: Males make up the vast majority of the player base, but on average spend less 
than females or other/non disclosed people. Males also tend to by the cheaper items than the 2 other categories.

obersvation 2: the age that plays this game the most is 15-24 accounting for about 70% of the player base between the two groups. although the game is played by people in those 2 age ranges the most, there are other age groups that on average spend as much, or more.

observation 3: accordling to the data, the most profitable items also tend to be the more expensive items, which shows that people are willing to spend more money for better items than but more items that are less expensive.